[Killed] EqualityOperator
main/components/MenuItemReview/MenuItemReviewForm.js:61:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.itemId?.message}
-                            {errors.itemId?.type === 'pattern' && 'Item Id must be valid.'}
+                            {errors.itemId?.type !== 'pattern' && 'Item Id must be valid.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Item Id/

Here are the matching elements:

<label
  class="form-label"
  for="itemId"
>

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:61:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.itemId?.message}
-                            {errors.itemId?.type === 'pattern' && 'Item Id must be valid.'}
+                            {errors.itemId?.type === 'pattern' || 'Item Id must be valid.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Item Id/

Here are the matching elements:

<label
  class="form-label"
  for="itemId"
>

[Killed] EqualityOperator
main/components/MenuItemReview/MenuItemReviewForm.js:103:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.stars?.message}
-                            {errors.stars?.type === 'pattern' && 'Stars must be a number from 1 to 5.'}
+                            {errors.stars?.type !== 'pattern' && 'Stars must be a number from 1 to 5.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars must be a number from 1 to 5./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:103:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.stars?.message}
-                            {errors.stars?.type === 'pattern' && 'Stars must be a number from 1 to 5.'}
+                            {errors.stars?.type === 'pattern' || 'Stars must be a number from 1 to 5.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars must be a number from 1 to 5./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:117:59
                             id="localDateTime"
                             type="datetime-local"
                             isInvalid={Boolean(errors.localDateTime)}
-                            {...register("localDateTime", { required: true, pattern: isodate_regex })}
+                            {...register("localDateTime", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /LocalDateTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:134:54
                             id="comments"
                             type="text"
                             isInvalid={Boolean(errors.comments)}
-                            {...register("comments", {
-                                required: "Comments is required."
-                            })}
+                            {...register("comments", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
