[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:35:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Request Id</Form.Label>
-                            <Form.Control
-                                data-testid="HelpRequestForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {false}
             </Row>
 
killedBy: HelpRequestForm tests renders correctly when passing in a HelpRequest
statusReason: Error: Unable to find an element by: [data-testid="/HelpRequestForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:35:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Request Id</Form.Label>
-                            <Form.Control
-                                data-testid="HelpRequestForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {true}
             </Row>
 
killedBy: HelpRequestForm tests renders correctly when passing in a HelpRequest
statusReason: Error: Unable to find an element by: [data-testid="/HelpRequestForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:81:52
                             id="teamId"
                             type="text"
                             isInvalid={Boolean(errors.teamId)}
-                            {...register("teamId", {
-                                required: "Team Id is required."
-                            })}
+                            {...register("teamId", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Team Id is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:165:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.solved && 'Solved is required.'}
+                            {errors.solved || 'Solved is required.'}
                             {errors.solved?.type === 'pattern' && 'Solved must be in the format true or false.'}
                         </Form.Control.Feedback>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:166:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.solved && 'Solved is required.'}
-                            {errors.solved?.type === 'pattern' && 'Solved must be in the format true or false.'}
+                            {errors.solved?.type === 'pattern' || 'Solved must be in the format true or false.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Solved must be in the format true or false.</div> instead

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:166:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.solved && 'Solved is required.'}
-                            {errors.solved?.type === 'pattern' && 'Solved must be in the format true or false.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Solved must be in the format/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
