[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:42:9
             Header: 'Requester Email',
             accessor: 'requesterEmail',
         },
-        {
-            Header: 'Team Id',
-            accessor: 'teamId',
-        },
+        {},
         {
             Header: 'Table or Breakout Room',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:43:21
             accessor: 'requesterEmail',
         },
         {
-            Header: 'Team Id',
+            Header: "",
             accessor: 'teamId',
         },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Team Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:44:23
         },
         {
             Header: 'Team Id',
-            accessor: 'teamId',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-teamId"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:58:9
             Header: 'Explanation',
             accessor: 'explanation',
         },
-        {
-            Header: 'Solved',
-            accessor: 'solved',
-        },
+        {},
     ];
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:65:43
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "HelpRequestTable"));
+        columns.push(ButtonColumn("Edit", "", editCallback, "HelpRequestTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "HelpRequestTable"));
     } 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
