[Killed] ObjectLiteral
src/main/utils/helpRequestUtils.js:9:12
 }
 
 export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/HelpRequest",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
+    return {}
 }
 
killedBy: helpRequestUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "method": "DELETE",
-   "params": Object {
